saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.EFM32ZGxxx_DFP.1.4.0.pdsc
          <book name="Documents/EFM32ZG222.pdf" title="EFM32ZG222 Data Sheet"/>
        </device>

        <!-- *************************  Device 'EFM32ZG222F32'  ***************************** -->
        <device Dname="EFM32ZG222F32">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG222F32"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG222F32.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00008000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00001000" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00008000"             default="1"/>

          <book name="Documents/EFM32ZG222.pdf" title="EFM32ZG222 Data Sheet"/>
        </device>

        <!-- *************************  Device 'EFM32ZG222F4'  ***************************** -->
        <device Dname="EFM32ZG222F4">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG222F4"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG222F4.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00001000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00001000"             default="1"/>

          <book name="Documents/EFM32ZG222.pdf" title="EFM32ZG222 Data Sheet"/>
        </device>

        <!-- *************************  Device 'EFM32ZG222F8'  ***************************** -->
        <device Dname="EFM32ZG222F8">
          <compile header="Device/EFM32ZG/Include/em_device.h" define="EFM32ZG222F8"/>
          <debug svd="SVD/EFM32ZG/EFM32ZG222F8.svd"/>
          <memory id="IROM1"                  start="0x00000000" size="0x00002000" startup="1" default="1"/>
          <memory id="IRAM1"                  start="0x20000000" size="0x00000800" init   ="0" default="1"/>
          <algorithm name="Flash/EFM32ZG.FLM" start="0x00000000" size="0x00002000"             default="1"/>

          <book name="Documents/EFM32ZG222.pdf" title="EFM32ZG222 Data Sheet"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="Compiler GCC">
      <require Tcompiler="GCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="EFM32ZG">
      <description>Silicon Labs EFM32ZG device series</description>
      <require Dvendor="Silicon Labs:21" Dname="EFM32ZG*"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="EFM32ZG CMSIS">
      <description>Silicon Labs EFM32ZG devices, CMSIS Core</description>
      <require condition="EFM32ZG"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>

    <!-- Device + CMSIS + Compiler Conditions -->
    <condition id="EFM32ZG CMSIS GCC">
      <description>Silicon Labs EFM32ZG devices, CMSIS Core, GCC compiler</description>
      <require condition="EFM32ZG CMSIS"/>
      <require condition="Compiler GCC"/>
    </condition>

    <!-- emlib Conditions -->
    <condition id="emlib Framework">
      <description>Silicon Labs emlib Framework</description>
      <require condition="EFM32ZG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
    </condition>
    <condition id="emlib SYSTEM">
      <description>Silicon Labs emlib with SYSTEM</description>
      <require condition="EFM32ZG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
    <condition id="emlib EMU">
      <description>Silicon Labs emlib with EMU</description>
      <require condition="EFM32ZG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="EMU"/>
    </condition>
    <condition id="emlib CMU">
      <description>Silicon Labs emlib with CMU</description>
      <require condition="EFM32ZG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
    </condition>
    <condition id="emlib CMU SYSTEM">
      <description>Silicon Labs emlib with CMU, SYSTEM</description>
      <require condition="EFM32ZG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
    </condition>
    <condition id="emlib CMU SYSTEM CORE">
      <description>Silicon Labs emlib with CMU, SYSTEM, CORE</description>
      <require condition="EFM32ZG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="SYSTEM"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CORE"/>
    </condition>
    <condition id="emlib CMU GPIO">
      <description>Silicon Labs emlib with CMU, GPIO</description>
      <require condition="EFM32ZG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="Framework"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
    </condition>

    <!-- bsp Conditions -->
    <condition id="EFM32ZG BSP core">
      <description>EFM32ZG STK3200 Board Support Core</description>
      <require condition="EFM32ZG"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="GPIO"/>
      <require Cclass="Device"        Cgroup="emlib"   Csub="CMU"/>
      <!--require Cclass="Device"        Cgroup="emlib"   Csub="EBI"/-->
      <!--require Cclass="Device"        Cgroup="emlib"   Csub="MSC"/-->
      <require Cclass="Device"        Cgroup="emlib"   Csub="LEUART"/>
    </condition>

