saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.EFM32ZGxxx_DFP.1.4.0.pdsc
      <component Cgroup="CORE" condition="EFM32ZG BSP core">
        <description>Silicon Labs BSP Core</description>
        <RTE_Components_h>
          #define RTE_BOARD_SUPPORT_STK3200
        </RTE_Components_h>
        <files>
          <file category="doc"     name="emdoc/efm32zg/html/group__kitdrv.html"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_bcc.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_stk.c"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_stk_leds.c"/>
          <file category="header"  name="Boards/SiliconLabs/common/bsp/bsp_trace.h"/>
          <file category="source"  name="Boards/SiliconLabs/common/bsp/bsp_trace.c"/>
          <file category="include" name="Boards/SiliconLabs/EFM32ZG_STK3200/config/"/>
        </files>
      </component>

      <component Cgroup="LED" Capiversion="1.0.0" condition="EFM32ZG BSP">
        <description>LED interface for Silicon Labs EFM32ZG-STK3200 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32ZG_STK3200/Common/LED_STK3200.c"/>
        </files>
      </component>
      <component Cgroup="Buttons" Capiversion="1.0.0" condition="EFM32ZG BSP">
        <description>Buttons interface for Silicon Labs EFM32ZG-STK3200 Development Kit</description>
        <files>
          <file category="source"  name="Boards/SiliconLabs/EFM32ZG_STK3200/Common/Buttons_STK3200.c"/>
        </files>
      </component>
    </bundle>
  </components>

  <boards>
    <board vendor="Silicon Labs" name="EFM32ZG-STK3200" revision="Ver 1.0">
      <description>Silicon Labs EFM32ZG Starter Kit</description>
      <image small="Boards/SiliconLabs/EFM32ZG_STK3200/Documents/efm32zg-stk3200_small.png"/>
      <book category="overview"  name="https://www.silabs.com/products/mcu/lowpower/Pages/efm32zg-stk3200.aspx" title="EFM32TG-STK3300 Web Page"/>
      <book category="manual"    name="Boards/SiliconLabs/EFM32ZG_STK3200/Documents/efm32zg-stk3200-ug.pdf" title="User Manual"/>
      <book category="schematic" name="Boards/SiliconLabs/EFM32ZG_STK3200/Documents/BRD2010A_B01.pdf"       title="Schematics"/>
      <mountedDevice    deviceIndex="0" Dvendor="Silicon Labs:21" Dname="EFM32ZG222F32"/>
      <compatibleDevice deviceIndex="0" Dvendor="Silicon Labs:21" DsubFamily="EFM32ZG222"/>
      <feature type="Button"     n="3"             name="Push-buttons: Reset, 2x User"/>
      <feature type="LED"        n="6"             name="LEDs: 4x Status, 2x User"/>
      <feature type="DIO"                          name="Breakout pads for easy access to I/O pins"/>
      <feature type="DIO"                          name="20 pin expansion header"/>
      <feature type="Touch"      n="2"             name="Capacitive touch pad"/>
      <feature type="GLCD"       n="1" m="128.128" name="Segment LCD"/>
      <feature type="PWR"        n="5"             name="USB Powered"/>
      <feature type="Batt"       n="1"             name="CR2032 battery"/>
      <feature type="ODbg"       n="1"             name="Onboard SEGGER J-Link USB debugger"/>
    </board>
  </boards>

  <examples>
    <example name="CMSIS-RTOS Blinky" doc="Abstract.txt" folder="Boards/SiliconLabs/EFM32ZG_STK3200/Blinky">
      <description>CMSIS-RTOS based Blinky example</description>
      <board name="EFM32ZG-STK3200" vendor="Silicon Labs"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>
  </examples>

</package>
